# RevisionSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionSettings Class
Members See Also
---
Provides access to project-wide settings related to revisions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class RevisionSettings : Element
```

Visual Basic
---
```text
Public Class RevisionSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class RevisionSettings : public Element
```

# Remarks
This class provides access to the project-wide settings that affect the appearance and numbering of revisions and revision clouds. The settings are only available in project documents.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..RevisionSettings
# See Also
RevisionSettings Members
Autodesk.Revit.DB Namespace